Revit 2026 API

# DocumentConvertModelToSymbolicCurves Method

---

Converts a group of ModelCurves to equivalent SymbolicCurves.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SymbolicCurveArray ConvertModelToSymbolicCurves(
	View view,
	ModelCurveArray modelCurves
)
```
```vb
Public Function ConvertModelToSymbolicCurves (
	view As View,
	modelCurves As ModelCurveArray
) As SymbolicCurveArray
```
```cpp
public:
SymbolicCurveArray^ ConvertModelToSymbolicCurves(
	View^ view,
	ModelCurveArray^ modelCurves
)
```
```fsharp
member ConvertModelToSymbolicCurves :
        view : View *
        modelCurves : ModelCurveArray -> SymbolicCurveArray
```

#### Parameters

view View
    The view where the new lines will be created. The lines are projected on the view workplane. The view workplane must be parallel to the view plane. If the lines are not parallel to the view plane, lines are foreshortened and arcs are converted to ellipses. Splines are modified.
modelCurves ModelCurveArray
     The model curve array to be converted.

#### Return Value

SymbolicCurveArray

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument is . |
| ArgumentException | Thrown when view is invalid to create SymbolicCurves on it. |
| InvalidOperationException | Thrown when current document is a family. Thrown when one or more curves could not be successfully converted, perhaps because some of the input curves could not be projected onto the active workplane of the view. |

This operation will create new SymbolicCurves with the modelCurves' geometry curves and delete the ModelCurve in the array. If modelCurves are not parallel to the workplane, they will be projected to the workplane and create new SymbolicCurves with the projected curves.

#### Reference

Document Class

Autodesk.Revit.DB Namespace